[
    {
        "year": 2020,
        "achievements": [
            "NUS Dean's List Academic Year 2019/2020 Semester 2 - Computer Science",
            "Awarded Outstanding Performance in CS3235 Computer Security",
            "Hack & Roll 2020 - Team Top 8"
        ]
    },
    {
        "year": 2019,
        "achievements": [
            "Represented Singapore at ICPC Asia Manila Regional Programming Contest held in Manila, Philippines, from 14 -15 December. Team 1st",
            "Represented Singapore at ICPC Asia Bangkok Regional Programming Contest held in Bangkok, Thailand, from 2 -3 November. Team 17th",
            "Google Code Jam to I/O for Women - 18th"
        ]
    },
    {
        "year": 2018,
        "achievements": [
            "Represented Singapore at ICPC Asia Singapore Regional Programming Contest held in Singapore, 12 - 14 December. Team 13th.",
            "Represented Singapore at ICPC Asia Yangon Regional Programming Contest held in Yangon, Myanmar, from 8 - 9 December. Team 11th",
            "Simon Marais Mathematics Competition (SMMC) - Team 1st",
            "Participated in 30th International Olympiad Informatics (IOI) held in Tsukuba, Japan, from 1 to 9 September 2018 as main coach. Team won 1 Gold, 2 Silvers and 1 Bronze",
            "Google Code Jam to I/O for Women - 1st"
        ]
    },
    {
        "year": 2017,
        "achievements": [
            "NUS High Excellence Award in Computing Studies",
            "Awarded NUS Merit Scholarship, for FY 2018/2019 -2021/2012",
            "Represented Singapore at the 29th International Olympiad in Informatics (IOI) held in Tehren, Iran, from 28 July to 4 August 2017. Silver Medal",
            "SMO (Open) - Gold Award",
            "NUS High Tay Eng Soon Scholarship",
            "Asia Pacific Informatics Olympiad (APIO) - Bronze Award",
            "NUS High Speech Day - DSO Star Award",
            "20th National Olympiad in Informatics (NOI) by SoC, NUS - Gold Medal, Individual 3rd"
        ]
    },
    {
        "year": 2016,
        "achievements": [
            "Australian Informatics Olympiad (AIO Senior) - Gold Award, Perfect Score",
            "Represented Singapore at the 15th China Girls' Math Olympiad (CGMO) held in Beijing China, 10 - 15 August 2016. Gold medal.",
            "SMO (Open) - Gold Award and Individual 5th",
            "A*STAR Science Award 2016 - 2017 (Junior College)",
            "Singapore International Mathematics Challenge (SIMC) - Team Distinction",
            "19th National Olympiad in Informatics (NOI) by SoC, NUS - Silver Medal, Best Female Medalist"
        ]
    },
    {
        "year": 2015,
        "achievements": [
            "Singapore Junior Physics Olympiad (SJPO) - Silver Award",
            "Australian Informaics Olympiad (AIO Senior) - Silver Award",
            "Represented Singapore at the 14th China Girls' Mathematical Olympiad (CGMO) held in Shen Zhen, Guangdong Province China, from 10 - 14 August 2015, Silver Medal",
            "SMO (Senior) - Gold Award and Individual 16th",
            "SMO (Open) - Bronze Award",
            "18th National Olympiad in Informatics (NOI) by School of Computing, NUS - Silver Medal",
            "American Mathematics Contest 10A (AMC10) - Distinguished Honor Roll, Invited to AIME",
            "37th C. B. Paul Memorial Science Quiz by ACJC - Individual Gold Award, Team 1st Runner-up"
        ]
    },
    {
        "year": 2014,
        "achievements": [
            "Australian Informatics Olympiad (AIO Intermediate) - Gold Award",
            "Australian Mathematics Competition (AMC Intermediate) - High Distinction (Top 2%)",
            "Represented Singapore at the 13th China Girls' Mathematical Olympiad (CGMO) held in Zhongshan, Guangdong Province China, from 10 - 14 August 2014. Silver medal",
            "SMO (Senior) - Gold Award and Individual 21st",
            "Awarded Edusave Scholarships for Integrated Programme Schools (ESIP), 2014 - 2017"
        ]
    },
    {
        "year": 2013,
        "achievements": [
            "Edusave Certificate of Academic Achievement - Top 25% in terms of academic performance in the level and course and good conduct",
            "Australian Mathematics Competition (AMC Junior) - Prize Award (Top 0.3%)",
            "SMO (Junior) - Gold Award",
            "SMO (Open) - Bronze Award",
            "Represented Singapore at the 12th China Girls' Mathematical Olympiad (CGMO) held in Ningbo, Zhejiang Province China, from 10 - 15 August 2013",
            "American Mathematics Contest 10A (AMC10) - Certificate of Achievement"
        ]
    },
    {
        "year": 2012,
        "achievements": [
            "Edusave Good Progress Award",
            "SMO (Junior) - Silver Award",
            "American Mathematics Contest 10A (AMC10) - Certificate of Achievement"
        ]
    },
    {
        "year": 2011,
        "achievements": [
            "EAGLES Award",
            "Top 10% Edusave Scholarship Award",
            "American Mathematics Contest 8 (AMC8) - Distinction and First Place Award",
            "Australian Mathematics Competition (AMC Upper Primary) - High Distinction",
            "University of New South Wales International Competitions for Schools - P6 Science (Distinction), P6 Maths (Distinction)",
            "Singapore Mathematical Olympiad (SMO Junior) - Bronze Award",
            "River Valley Maths Challenge (RVMC) by RVHS - Individual 10th",
            "Asia-Pacific Mathematical Olympiad for Primary Schools (APMOPS) by HCI - Individual 11th to 40th (Gold Medallion)",
            "Singapore ASEAN Schools Maths Olympiad (SASMO) - Perfect Score",
            "Maths Talent Quest by Clementi Town Sec - Gold Award, Individual 5th and Team 2nd",
            "Singapore National Girls' Mathematics Competition (SNGMC) by RGS - Individual 11th to 20th",
            "Singapore Mathematical Olympiad for Primary Schools (SMOPS) by HCI - Platinum Award",
            "RI Primary World Maths Contest (RIPWMC) - Certificate of Credit",
            "Inter School Maths and Science Competition by St Andrews Sec - Team 2nd"
        ]
    },
    {
        "year": 2010,
        "achievements": [
            "EAGLES Award",
            "Top 5% Edusave Scholarship Award",
            "American Mathematics Contest 8 (AMC8) - Honour Achievement Roll",
            "Top in P5 Level Maths (Overall)",
            "Top in P5 Level Science (Overall)",
            "3rd Annual Mathlympics by ACS(I) - Gold Award and Team 3rd Runner-up",
            "Australian Mathematics Competition (AMC Upper Primary) - Distinction",
            "National Mathematical Olympiad of Singapore (NMOS), by NUS High - Gold Award and Individual 14th",
            "University of New South Wales International Competitions for Schools - P5 Science (Distinction), P5 Maths (High Distinction)"
        ]
    },
    {
        "year": 2009,
        "achievements": [
            "American Mathematics Contest 8 (AMC8)- Gold Award, Merit Achievement Roll",
            "Top in P4 Level Maths (Overall)",
            "University of New South Wales International Competitions for Schools - P4 Science (High Distinction), P4 Maths (High Distinction)",
            "National Mathematical Olympiad of Singapore (NMOS) for P5 Students, by NUS High - Bronze Award",
            "Australian Mathematics Competition (AMC Middle Primary) - Distinction"
        ]
    },
    {
        "year": 2008,
        "achievements": [
            "University of New South Wales International Competitions for Schools - P3 Science (Distinction), P3 Maths (Distinction)"
        ]
    },
    {
        "year": 2007,
        "achievements": [
            "Top in P2 Level Maths (Overall)",
            "University of New South Wales International Competitions for Schools - P3 Maths (Distinction)"
        ]
    }
]